In [31]:
# Instalando a biblioetca Pandas
!pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in c:\users\dsadm\appdata\roaming\python\python313\site-packages (2.3.1)
Requirement already satisfied: numpy>=1.26.0 in c:\users\dsadm\appdata\roaming\python\python313\site-packages (from pandas) (2.3.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\dsadm\appdata\roaming\python\python313\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\dsadm\appdata\roaming\python\python313\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\dsadm\appdata\roaming\python\python313\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\dsadm\appdata\roaming\python\python313\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [32]:
# Importando a biblioteca pandas
import pandas as pd

In [33]:
# Criando um dicio√°rio
Dicionario = {
    'A':[1,2,3],
    'B':[-3,-2,-1],
    'C':[0,10,20]
}
Label = ['1 Linha','2 Linha','3 Linha']
Dataframe_01 = pd.DataFrame(Dicionario,index=Label)
print(Dataframe_01)

         A  B   C
1 Linha  1 -3   0
2 Linha  2 -2  10
3 Linha  3 -1  20

In [34]:
# Exibindo as colunas A e B
Dataframe_01[['A','B']]

         A  B
1 Linha  1 -3
2 Linha  2 -2
3 Linha  3 -1

In [43]:
# Criando uma coluna nova no Dataframe
Dataframe_01['Nova coluna'] = Dataframe_01['A'] *Dataframe_01['B']
Dataframe_01 # Exibe o dataframe

         A  B   C  Nova coluna
1 Linha  1 -3   0           -3
2 Linha  2 -2  10           -4
3 Linha  3 -1  20           -3

In [45]:
#Exibindo valores na saida da celula do notebook
a =6
print(a)
Dataframe_01

6

         A  B   C  Nova coluna
1 Linha  1 -3   0           -3
2 Linha  2 -2  10           -4
3 Linha  3 -1  20           -3

In [44]:
#Excluindo uma coluna do Dataframe
# Drop exclui uma linha ou coluna do Dataframe
Dataframe_01.drop('Nova coluna', axis=1) #Exclui a nova coluna do Dataframe 1

         A  B   C
1 Linha  1 -3   0
2 Linha  2 -2  10
3 Linha  3 -1  20

In [47]:
# Excluindo uma coluna definitivamente do Dataframe
Dataframe_01.drop('Nova coluna', axis=1, inplace=True)

In [48]:
Dataframe_01

         A  B   C
1 Linha  1 -3   0
2 Linha  2 -2  10
3 Linha  3 -1  20